{"headings": [], "body": ["Mauritania", "Institution", "African Development Bank", "Procurement type", "Consulting Services - Firm", "Notice type", "  Request for Expression of Interest", "Project name", "Public Enterprise Governance Support Project (PAGEP) Title NOTICE OF EXPRESSION OF INTEREST for the Recruitment of an international consultant (firm) for the delegation for project management, engineering and development of the information system of the Financial Supervision Department ", "ISLAMIC REPUBLIC OF MAURITANIA", "Ministry Delegate to the Minister of Economy and Finance Responsible for the Budget", "(MDMEFCB)", "Public Enterprise Governance Support Project", "(PAGEP)", "Loan Agreement Reference: No. 2100150044145", "Project Identification No.: P-MR-K00-019", "NOTICE OF EXPRESSION OF INTEREST for the Recruitment of an international consultant (firm) for the delegation for project management, engineering and development of the information system of the Financial Supervision Department", "The Government of the Islamic Republic of Mauritania has obtained a loan from the African Development Fund (ADF) to contribute to the financing of the Public Enterprise Governance Support Project (PAGEP) and intends to use part of the sums granted under the Loan to finance the service contract of an international Consultant (firm) for the project management and engineering (MOA) and the  development of the DTF information system .", "Objectives of the consultant’s mission:", "The consultant's mission aims to:", "Provide detailed specifications for the new information system;", "Participate in the development of the IS DAO in accordance with the BAD DAO model;", "Assist the DTF in selecting the IS developer", "Ensure project management by delegation of the DGTF;", "Assist the DTF in all phases of the IS acquisition and operation process.", "Expected results:", "            At the end of its mission, the firm should provide all the deliverables provided for in the TDR, in particular:", "Documentary deliverable 1 - Diagnostic report;", "Documentary deliverable 2 - Detailed specifications of the target system and development of the DAO;", "Documentary deliverable 3: TDR for the recruitment of the bidder;", "Documentary Deliverable 4: Extensive functional test plan of project deliverables.", "The Implementation Unit of the Public Enterprise Governance Support ", "Project, hereinafter referred to as the “Executing Body”, invites ", "Consultants to submit their applications to provide the services ", "described above. Interested consultants must provide information on ", "their capacity and experience demonstrating that they are qualified for ", "the services (documentation, reference of similar services, experience ", "in comparable missions, availability of qualified personnel, etc.). ", "Consultants may form associations to increase their chances of ", "qualification.", "  The eligibility criteria, the establishment of the shortlist and the ", "selection procedure will be in accordance with the provisions of the ", "“Procurement Policy” of the African Development Bank, August 2015 ", "edition, available on the Bank's website at:  http://www.afdb.org .", "Interested consultants may obtain further information at the address ", "mentioned below during the following office opening days and hours: 9am ", "to 5pm Monday to Thursday and 8am to 12pm Friday (TU+0).", "General Directorate of Financial Supervision - Ministry Delegate to the ", "Ministry of Economy and Finance in charge of the Budget Nouakchott, ", "Mauritania.", "Phone: 00 222 36 27 81 80", "Email: adade@tax.gov.mr, Nouakchott-Mauritania.", "For the attention of Mr. Abdelghader DADE, Director of Financial ", "Supervision.", "  Expressions of interest must be submitted or sent by email to the ", "address of the Commission des Marchés de l'Economie et des Finances ", "mentioned below no later than Monday, November 18, 2024 at 3:00 p.m. ", "local time (UT+0)  and bear the following mention: expressly the ", "mention: \"Recruitment of an international consultant (firm) for the ", "delegation for project management, engineering and development of the ", "information system of the General Directorate of Financial Supervision\".", "Public Procurement Commission / Economy and Finance,", "Address: Ilot ZRC, Rue Omar, Lot 227- BP: 5193 Nouakchott, Mauritania", "Telephone: 222 45 29 41 88, PO Box: 5193.", "Email : cheikhna.mlemine@gmail.com", "The PAGEP Coordinator", "Abdeghader DADE"], "tables": [], "headers": [""], "footers": [""], "text_boxes": []}