{"headings": [["Heading 1", "COMMISSION ON ADMINISTRATIVE JUSTICE"], ["Heading 1", "TENDER NO. CAJ/RS/01/2024-2025"], ["Heading 1", "INVITATION TO APPLY FOR REGISTRATION OF SUPPLIERS"], ["Heading 1", "CATEGORY A: REGISTRATION FOR SUPPLY AND DELIVERY OF GOODS"], ["Heading 2", "Address for obtaining further information and for purchasing tender documents"], ["Heading 1", "SECTION I"], ["Heading 2", "General"], ["Heading 2", "Fraud and Corruption"], ["Heading 2", "Collusive practices"], ["Heading 2", "Eligible Applicants"], ["Heading 2", "Eligibility"], ["Heading 2", "Contents of the Prequalification Documents Sections of Prequalification Document"], ["Heading 2", "PART 1 - Prequalification Procedures"], ["Heading 2", "PART 2 - Works, Goods, or Non-Consulting Services Requirements"], ["Heading 2", "Clarification of Prequalification Documents, site visit(s) and Pre-Application Meeting"], ["Heading 2", "Amendment of Prequalification Document"], ["Heading 2", "Preparation of Applications Cost of Applications"], ["Heading 2", "Language of Application"], ["Heading 2", "Documents Comprising the Application"], ["Heading 2", "Application Submission Letter"], ["Heading 2", "Documents Establishing the Eligibility of the Applicant"], ["Heading 2", "Documents Establishing the Qualifications of the Applicant"], ["Heading 2", "Signing of the Application and Number of Copies"], ["Heading 2", "Submission of Applications Sealing and Marking of Applications"], ["Heading 2", "Deadline for Submission of Applications"], ["Heading 2", "Late Applications"], ["Heading 2", "Opening of Applications"], ["Heading 2", "Procedures for Evaluation of Applications"], ["Heading 2", "Clarification of Applications"], ["Heading 2", "Responsiveness of Applications"], ["Heading 2", "Margin of Preference"], ["Heading 2", "Nominated Subcontractors"], ["Heading 2", "Evaluation of Applications and Prequalification of Applicants Evaluation of Applications"], ["Heading 2", "Procuring Entity's Right to Accept or Reject Applications"], ["Heading 2", "Prequalification of Applicants"], ["Heading 2", "Invitation to Tender"], ["Heading 2", "Changes in Qualifications of Applicants"], ["Heading 2", "Procurement Related Complaints and Administrative Review"], ["Heading 1", "SECTION II"], ["Heading 1", "REGISTRATION DATA SHEET (RDS)"], ["Heading 2", "Mandatory Evaluation Criteria"], ["Heading 1", "SECTION IV"], ["Heading 1", "APPLICATION FORMS"], ["Heading 2", "Form ELI -1.1 - Applicant Information Form"], ["Heading 1", "TENDERER'S ELIGIBILITY - CONFIDENTIAL BUSINESS QUESTIONNAIRE"], ["Heading 2", "Instruction to Tenderer"], ["Heading 1", "APPLICANT AND"], ["Heading 2", "…………………………………RESPONDENT (Procuring Entity)"], ["Heading 1", "REQUEST FOR REVIEW"], ["Heading 1", "SIGNED"]], "body": ["P.O BOX 20414– 00200 NAIROBI", "EMAIL: procurement @ombudsman.go.ke", "REGISTRATION OF SUPPLIERS FY 2024-2026", "Tenderer's    Name………......………………………………………………………………….….. Category Name...................................…………………………………………………… Category    Ref    No……………………………………………………………………………………", "TABLE OF CONTENT", "Name of Contract: REGISTRATION OF SUPPLIERS", "Registration Reference No.: CAJ/RS/01/2024- 2025", "The Commission on Administrative Justice (CAJ) intends to register firms/companies who would be called upon as and when need arises to provide various services, goods and works.", "This is open to all who are qualified as per the category table below.", "Interested tenderers may inspect the goods to be sold during office hours [0800 to 1700 hours] at the address given below.", "A complete set of tender documents may be purchased or obtained by interested tenders upon payment of a non-refundable fees of (Kshs 1,000) in cash or Banker's Cheque and payable to the address given below. Tender documents may be obtained electronically from the CAJ and PPIP websitewww.ombudsman.go.ke; and www.tender.go.ke; . Tender documents obtained electronically will be free of charge.", "Tender documents may be viewed and downloaded for free from the website www.ombudsman.go.ke; and www.tenders.go.ke; . Tenderers who download the tender document must forward their particulars immediately to procurement@ombudsman.go.ke to facilitate any further clarification or addendum.", "Applications for Registration should be submitted by hand/courier delivery, clearly marked envelopes and delivered to the address given below by or before 19th June 2024 at 12.00pm", "All applicants should clearly indicate in the envelope the category they are interested in. One document shall present ONLY ONE category. For those interested in various categories, they should submit separate documents in the various categories.", "Late applications will be rejected.", "The addresses referred to above are", "Commission on Administrative Justice", "1ST Floor, Westend Towers , Waiyaki Way , - Nairobi", "P.O. 20414- 00200 NAIROBI, KENYA", "Head of Procurement, Tel: 020 2270000 Email: procurement@ombudsman.go.ke", "Address for Submission of Tenders", "Commission on Administrative Justice", "P.O Box 20414- 00200", "Nairobi, Kenya", "1ST Floor, West End Towers, waiyaki way , Nairobi", "Address for Opening of Tenders.", "Commission on Administrative Justice", "P.O Box 20414- 00200", "Nairobi, Kenya", "1ST Floor, West End Towers, waiyaki way , Nairobi", "COMMISSION SECRETARY/CEO 4TH JUNE ,2024", "INSTRUCTIONS TO APPLICANTS (ITA)", "Scope of Application", "The name of the Procuring Entity inviting for applications is defined in the Prequalification/Registration Documents (PDS/RDS). The particular type of contract (works, goods or Non-Consulting Services required) and its name and description of the contract(s) and its reference number are defined in the PDS. If the scope ofcontract so defined is in multiple contracts, it will be specified in the PDS if prequalification will be based on individual contracts or multiple contracts. The Full scope of Works or Goods or Non-Consulting Services are described in Section V (Scope of Works or goods contract).", "Source of Funds to be specified in the PDS, if deemed necessary.", "The Government of Kenya requires compliance with its Anti-Corruption laws and its prevailing sanctionspolicies and procedures.", "In further pursuance of this policy, Applicants shall permit and shall cause their agents (where declared or not), subcontractors, sub consultants, service providers, suppliers, and their personnel, to permit the Public Procurement Regulatory Authority (PPRA) to inspect all accounts, records and other documents relating to any initial selection process, prequalification process, tender submission(incase prequalified),proposal submission, and contract performance (in the case of award), and to have them audited by auditors appointedby the PPRA.", "The Procuring Entity requires compliance with the provisions of the Competition Act 2010, regarding collusive practices in contracting. Any applicant found to have engaged in collusive conduct shall be disqualified and criminal and/or civil sanctions may be imposed. To this effect, applicants shall be required to complete and sign a Certificate of Independent Tender Determination” annexed to the Form of applicant.", "Applicants shall meet the eligibility criteria as per this ITA and ITA 5.1and 5.2. An Applicant", "may be a firm that is a private entity, a state-owned enterprise or institution subject to ITA", "5.9 or any combination of such entities in the form of a joint venture (“JV”) under an existing agreement or with the intent to enter into such an agreement supported by a letter of intent. In the case of a joint venture, all members shall be jointly and severally liable for the execution of the entire Contract in accordance with the Contract terms. The JV shall nominate a Representative who shall have the authority to conduct all business for and on behalf of any and all the members of the JV during the prequalification process, tendering (in the event the JV submits a Tender) and during contract execution (in the event the JV is awarded the Contract). Members of a joint venture may not also make an individual tender, be a subcontractor in a separate tender or be part of another joint venture for the purposes of the same Tender. The maximum", "number of JV members shall be specified in the PDS.", "Public Officers of the Procuring Entity, their Spouses, Child, Parent, Brothers or Sister. Child, Parent, Brother or Sister of a Spouse, their business associates or agents and firms/organizations in which they have a substantial or controlling interest shall not be eligible to be prequalified. Public Officers with such relatives are also not allowed to participate in any procurement proceedings.", "A firm may apply for prequalification both individually, and as part of a joint venture, or participate as a subcontractor. If prequalified, it will not be permitted to tender for the same contract both as an individual firm and as a part of the joint venture or as a subcontractor. However, a firm may participate as a subcontractor in more than one Tender, but only in that capacity. Tenders submitted in violation of this procedure will be rejected.", "A firm and any of its affiliates (that directly or indirectly control, are controlled by or are under common control with that firm) may submit its application for prequalification either individually, as joint venture or as a subcontractor among them for the same contract. However, if prequalified, only one prequalified Applicant will be allowed to tender for the. All Tenders submitted in violation of this procedure will be rejected.", "An Applicant may have the nationality of any country, subject to the restrictions pursuant to ITA 5.1 and 5.2. An Applicant shall be deemed to have the nationality of a country if the Applicant is constituted, incorporated or registered in and operates in conformity with the provisions of the laws of that country, as evidenced by its articles of incorporation (or equivalent documents of constitution or association) and its registration documents, as the case may be. sub-contractors or suppliers for any part of the Contract including related Non-Consulting Services.", "Applicants shall not have a conflict of interest. Applicants shall be considered to have a conflict of interest, if they, or any of their affiliates, participated as a consultant in the preparation of the design or technical specifications or have been hired or proposed to be hired by the Procuring Entity as Engineer for contract implementation of the contract(s) that are the subject of this prequalification. In addition, Applicants may be considered to have a conflict of interest if they have a close business or family relationship with a professionalstaff of the Procuring Entity who:", "are directly or indirectly involved in the preparation of the prequalification Document or Invitation to Tender (ITT), Document or specifications of the Contract, and/or the Tender evaluation process of such Contract; or", "would be involved in the implementation or supervision of such Contract, unless the conflict stemming from such relationship has been resolved in a manner acceptable to the Procuring Entity throughout the prequalification, ITT process and execution of the Contract.", "An Applicant that has been debarred shall be ineligible to be initially selected for, prequalified for, tender for, propose for, or be awarded a contract during such period of time as the PPRA shall have determined. The list of debarred firms and individuals is available at www.ppra.go.ke", "Applicants that are state-owned enterprise or institutions in Kenya may be eligible to prequalify, compete and be awarded a Contract(s) only if they can establish, in a manner accept able to the Procuring Entity, that they", "are legally and financially autonomous (ii) operate under commercial law, and", "(iii) are not undersupervision of any public entity.", "An Applicant shall not be under sanction of debarment from Tendering by the", "PPRA as the result of the execution of a Tender/Proposal–Securing Declaration.", "An Applicant that is a Kenyan firm or citizen shall provide evidence of having fulfilled his/her tax obligations by producing a current tax clearance certificate or tax exemption certificate issued by the Kenya Revenue Authority.", "An Applicant shall provide any other such documentary evidence of eligibility satisfactory to the Procuring Entity, as the Procuring Entity shall reasonably request.", "Firms and individuals may be ineligible if they are nationals of ineligible countries as indicated herein. The countries, persons or entities are in eligible if:", "As a matter of law or official regulations, Kenya prohibits commercial relations with that country, or", "By an act of compliance with a decision of the United Nations Security Council taken under ChapterVII of the Charter of the United Nations, Kenya prohibits any import of goods or contracting of works or Non- Consulting Services from that country, or any payments to any country, person, or entity in that country.", "When the Works, supply of Goods or provision of non-consulting services are implemented a cross jurisdictional boundary (and more than one country is a Procuring Entity, and is involved in the procurement), then exclusion of a firm or individual on the basis of ITA 5.1 (a) above by any country may be applied to that procurement a cross other countries involved, if the Procuring Entities involved in the procurement so agree.", "Any goods, works and production processes with characteristics that have been declared by the relevant national environmental protection agency or by other competent authority as harmful to human beings and to the environment shall not be eligible for procurement.", "This Prequalification Document consists of parts1 and 2 which comprise all the sections indicated below, and which should be read in conjunction with any Addendum issued in accordance with IT A8.", "Section I- Instructions to Applicants (ITA)", "Section II - Prequalification Data Sheet (PDS)", "Section III - Qualification Criteria and Requirements", "Section IV- Application Forms", "Section VII- Scope of Works, Goods, or Non-Consulting Services", "Unless obtained directly from the Procuring Entity, the Procuring Entity accepts no responsibility for the completeness of the document, responses to requests for clarification, the minutes of the pre-Application meeting (if any), or Addenda to the Prequalification Document in accordance with ITA 8. In case of any discrepancies,", "documents issued directly by the Procuring Entity shall prevail.", "The Applicant is expected to examine all instructions, forms, and terms in the Prequalification Document and to furnish with its Application all information or documentation as is required by the Prequalification Document.", "An Applicant requiring any clarification of the Prequalification Document shall contact the Procuring Entity inwriting at the Procuring Entity's address indicated in the PDS. The Procuring Entity will respond in writing to any request for clarification provided that such request is received no later than fourteen (14) days prior to the deadline for submission of the applications. The Procuring Entity shall forward a copy of its response to all prospective Applicants who have obtained the Prequalification Document directly from the Procuring Entity, including a description of the inquiry but without identifying its source. If so indicated in the PDS, the Procuring Entity shall also promptly publish its response at the webpage identified in the PDS. Should the Procuring Entity deem it necessary to amend the Prequalification Document as a result of a clarification, it shall do so following the procedure under ITA 8. And in accordance with the provisions of ITA 17.2.", "The Applicant, at the Applicant's own responsibility and risk, is encouraged to visit and examine and inspect the Site of the required contracts and obtain all information that may be necessary for preparing the application. The costs of visiting the Site shall be at the Applicant's own expense. The Procuring Entity shall specify in the PDS if a pre- application meeting will be held, when and where. The Procuring Entity shall also specify in the PDS if a pre-arranged Site visit will be held and when. The Applicant's designated representative is invited to attend a pre- application meeting and a pre-arranged site visit. The purpose of the meetings will be to clarify issues and to answer questions on any matter that may be raised at that stage.", "The Applicant is requested to submit any questions in writing, to reach the Procuring Entity not later than the period specified in the PDS before the submission date of applications.", "Minutes of a pre-arranged site visit and those of the pre-application meeting, if applicable, including the textof the questions asked by Applicants and the responses given, together with any responses prepared after the meeting, will be transmitted promptly to all Applicants who have acquired the prequalification documents. Minutes shall not identify the source of the questions asked.", "The Procuring Entity shall also promptly publish anonymized (no names) Minutes of the pre-arranged sitevisit and those of the pre-proposal meeting at the web page identified in the PDS. Any modification to the Prequalification Documents that may become necessary as a result of the pre-arranged site visit and those of the pre-application meeting shall be made by the Procuring Entity exclusively through the issue of an Addendum pursuant to PDS 8 and not through the minutes of the pre-application meeting. Non-attendance at the pre- arranged site visit and the pre-tender meeting will not be a cause for disqualification of a Tenderer.", "At any time prior to the deadline for submission of Applications, the Procuring Entity may amend the Prequalification Document by issuing an Addendum.", "Any Addendum issued shall be part of the Prequalification Document and shall be", "communicated in writing to all Applicants who have obtained the Prequalification", "Document from the Procuring Entity. The Procuring Entity shall promptly publish the Addendum at the Procuring Entity's webpage identified in the PDS.", "To give Applicants reasonable time to take an Addendum into account in preparing their Applications, the Procuring Entity may, at its discretion, extend the deadline for the submission of Applications in accordance with ITA 17.2.", "The Applicant shall bear all costs associated with the preparation and submission of its Application. The Procuring Entity will in no case be responsible or liable for those costs, regardless of the conduct or outcome of the prequalification process.", "The Application as well as all correspondence and documents relating to the prequalification exchanged by theApplicant and the Procuring Entity, shall be written in English Language. Supporting documents and printed literature that are part of the Application may be in another language, provided they are accompanied by an accurate translation of the relevant passages in the English language, in which case, for purposes of interpretation of the Application, the translation shall govern.", "The Application shall comprise the following:", "Application Submission Letter, in accordance with ITA 13.1;", "Eligibility: documentary evidence establishing the Applicant's eligibility, in accordance with ITA 14.1;", "Qualifications: documentary evidence establishing the Applicant's qualifications, in accordance with ITA 15; and", "Any other document required as specified in the PDS.", "The Applicant shall furnish information on commissions and gratuities, if any, paid or to be paid to agents or any other party relating to this Application.", "The Applicant shall complete an Application Submission Letter as provided in Section IV (Application Forms). This Letter must be completed without any alteration to its format.", "To establish its eligibility in accordance with ITA 4, the Applicant shall complete the eligibility declarations in the Application Submission Letter and Forms ELI (eligibility) 1.1 and 1.2, included in Section IV (Application Forms).", "To establish its qualifications to perform the contract(s) in accordance with Section III, Qualification Criteria and Requirements, the Applicant shall provide the information requested in the corresponding Information Sheets included in Section IV (Application Forms).", "Wherever an Application Form requires an Applicant to state a monetary amount, Applicants should indicate the Kenya Shilling equivalent using the rate of exchange determined as follows:", "For construction turnover or financial data required for each Year-Exchange rate prevailing on the last dayof the respective calendar year (in which the amounts for that year is to be converted).", "Value of single Contract-Exchange rate prevailing on the date of the contract.", "Exchange rates shall be taken from the publicly available source identified in the PDS. Any error in determining the exchange rates in the Application may be corrected by the Procuring Entity.", "Applicants shall be asked to provide, as part of the data for qualification, such information, including details ofownership, as shall be required to determine whether, according to the classification established by the Procuring Entity, a particular contractor or group of contractors qualifies for a margin of preference. Further the information will enable the Procuring Entity identify any actual or potential conflict of interest in relation to the procurement and/or contract management processes, or a possibility of collusion between Applicants, and thereby help to prevent any corrupt influence in relation to the procurement processor contract management.", "The purpose of the information described in ITT 6.2 above overrides any claims to confidentiality which an Applicant may have. There can be no circumstances in which it would be justified for an Applicant to keep information relating to its ownership and control confidential where it is tendering to undertake public sector work and receive public sector funds. Thus, confidentiality will not be accepted by the Procuring Entity as a justification for an Applicant's failure to disclose, or failure to provide required in formation on its ownership and control.", "The Applicant shall provide further documentary proof, information or authorizations that the ProcuringEntity may request in relation to ownership and control which information on any changes to the information which was provided by the Applicant under ITT 6.3. The obligations to require this information shall continue for the duration of the procurement process and contract performance and after completion of the contract, if any change to the information previously provided may reveal a conflict of interest in relation to the award or management of the contract.", "All information provided by the Applicant pursuant to these requirements must be complete, current and accurate as at the date of provision to the Procuring Entity. In submitting the information required pursuant to these requirements, the Applicant shall warrant that the information submitted is complete, current and accurate as at the date of submission to the Procuring Entity.", "If an Applicant fails to submit the information required by these requirements, its application will be rejected. Similarly, if the Procuring Entity is unable, after taking reasonable steps, to verify to a reasonable degree the information submitted by an Applicant pursuant to these requirements, then the application will be rejected.", "If information submitted by an Applicant pursuant to these requirements, or obtained by the Procuring Entity (whether through its own enquiries, through notification by the public or otherwise), shows any conflict of interest which could materially and improperly benefit the Applicant in relation to the procurement or contractmanagement process, then:", "If the procurement process is still ongoing, the Applicant will be disqualified from the procurement process,", "If the contract has been awarded to that Applicant, the contract award will be set aside,", "the Applicant will be referred to the relevant law enforcement authorities for investigation of whether theApplicant or any other persons have committed any criminal offence.", "If an Applicant submits information pursuant to these requirements that is incomplete, in accurate or out-of- date, or attempts to obstruct the verification process, then the consequences ITT 6.7 will ensue unless the Applicant can show to the reasonable satisfaction of the Procuring Entity that any such act was not material, or was due to genuine error which was not attributable to the intentional act, negligence or recklessness of the Applicant.", "The Applicant shall prepare one original of the documents comprising the Application as describedinITA11 and clearly mark it “ORIGINAL”. The original of the Application shall be typed or written in indelible inkand shall be signed by a person duly authorized to sign on behalf of the Applicant. In case the Applicant is a JV, the Application shall be signed by an authorized representative of the JV on behalf of the JV and so as to be legally binding on all the members as evidenced by a power of attorney signed by their legally authorized signatories.", "The Applicant shall submit copies of the signed original Application, in the number specified in the PDS, and clearly mark them “COPY”. In the event of any discrepancy between the original and the copies, the original shall prevail.", "The Applicant shall enclose the original and the copies of the Application in a sealed envelope that shall:", "a Bear the name and address of the Applicant;", "Be addressed to the Procuring Entity, in accordance with ITA 17.1; and", "Bear the specific identification of this prequalification process indicated in the PDS1.1.", "The Procuring Entity will accept no responsibility for not processing any envelope that", "was not identified as required in ITA 16.1 above.", "Applicants may either submit their Applications by mail or by hand. Applications shall be received by the Procuring Entity at the address and no later than the deadline indicated in the PDS. When so specified in the PDS, Applicants have the option of submitting their Applications electronically, in accordance with electronic Application submission procedures specified in the PDS.", "The Procuring Entity may, at its discretion, extend the deadline for the submission of Applications by amending the Prequalification Document in accordance with ITA 8, in which case all rights and obligations of the Procuring Entity and the Applicants subject to the previous deadline shall thereafter be subject to the deadline as extended.", "The Procuring Entity reserves the right to accept applications received after the deadline for submission of applications, unless otherwise specified in the PDS. If late applications will be accepted, they must be receivednot later than the date specified in the TDS after the deadline for submission of applications.", "The Procuring Entity shall open all Applications at the date, time and place specified in", "the PDS. Late Applications shall be treated in accordance with ITA 19.1.", "Applications submitted electronically (if permitted pursuant to ITA 17.1) shall be opened in accordance with the procedures specified in the PDS.", "20.2 The Procuring Entity shall prepare a record of the opening of Applications to include, as a minimum, the nameof the Applicants. A copy of the record shall be distributed to all Applicants.", "Confidentiality", "Information relating to the Applications, their evaluation and results of the prequalification shall not be disclosed to Applicants or any other persons not officially concerned with the prequalification process until the notification of prequalification results is made to all Applicants in accordance with ITA 28.", "From the deadline for submission of Applications to the time of notification of the results of the prequalification in accordance with ITA 28, any Applicant that wishes to contact the Procuring Entity on any matter related to the prequalification process may do so only in writing.", "To assist in the evaluation of Applications, the Procuring Entity may, at its discretion, ask an Applicant for a clarification (including missing documents) of its Application, to be submitted within a stated reasonable period of time. Any request for clarification from the Procuring Entity and all clarifications from the Applicantshall be in writing.", "1 If an Applicant does not provide clarifications and/or documents requested by the date and time set in the Procuring Entity's request for clarification, its Application shall be evaluated based on the information and documents available at the time of evaluation of the Application.", "The Procuring Entity may reject any Application which is not responsive to the requirements of the Prequalification Document. In case the information furnished by the Applicant is incomplete or otherwise requires clarification as per ITA 21.1, and the Applicant fails to provide satisfactory clarification and/or missing information, it may result in disqualification of the Applicant.", "Unless otherwise specified in the PDS, a margin of preference shall not apply in the Tendering process resulting from this prequalification.", "Unless otherwise stated in the PDS, the Procuring Entity does not intend to execute any specific elements of the works by sub-contractors selected in advance by the Procuring Entity (so-called “Nominated Subcontractors”).", "The Applicant shall not propose to subcontract the whole of the Works or Goods. The maximum limit of subcontracting permitted under the contract may be specified by the Procuring Entity in the Tendering Document. The Procuring Entity, in ITA 25.2, may permit the Applicant to propose subcontractors for certain specialized parts of the contract as indicated there in as (“Specialized Subcontractors”). Applicants planning to use such Specialized Subcontractors shall specify, in the Application Submission Letter, the activity(ies) or parts of the Works proposed to be subcontracted along with details of the proposed subcontractors including their qualification and experience.", "The Procuring Entity shall use the factors, methods, criteria, and requirements defined in Section III,Qualification Criteria and Requirements, to evaluate the qualifications of the Applicants, and no other methods, criteria, or requirements shall be used. The Procuring Entity reserves the right to waive min or deviations from the qualification criteria if they do not materially affect the technical capability and financial resources of an Applicant to perform the Contract.", "Subcontractors proposed by the Applicant shall be fully qualified and meet the minimum specific experience criteria as specified for their parts of the proposed contract for Works or Goods or non-consulting services. The subcontractor's qualifications shall not be used by the Applicant to qualify for the Works or Goods or non- consulting services unless their parts of the Works or Goods or non-consulting services were previouslydesignated by the Procuring Entity in the PDS as can be met by Specialized Subcontractors, in which case:", "The Specialized Subcontractors shall meet the minimum qualification", "requirements specified in SectionIII, and", "the qualifications with respect to specific experience of the Specialized Subcontractor proposed by the Applicant may be added to the qualification of the Applicant for the purpose of the evaluation.", "Unless the Applicant has been determined prequalified on its own without taking into account the qualification and experience of the proposed specialized sub- contractor, the tender submitted by the Applicant shall include the same specialized sub-contractor failing which, such tender may be rejected unless a change in the specialized sub-contractor was requested by the Applicant and approved by the Procuring Entity subsequent to prequalification but before the tender submission deadline in accordancewith ITA 30.", "In case of multiple contracts, Applicants should indicate in their Applications the individual contract or combination of contracts in which they are interested. The Procuring Entity shall prequalify each Applicant for each lot and for a combination of contracts for which the Applicant has thereby indicated its interest and for which the Applicant meets the appropriate aggregate requirements the Eligibility and Qualification Criteria.", "Further, in the case of multiple contracts, the Procuring Entity will prepare the Eligibility and QualificationCriteria Form for items 3.1, 3.2, 4.2(a) and 4.2(b) for each Lot, to be completed by applicants.", "Only the qualifications of the Applicant shall be considered. The qualifications of other firms, including the Applicant's subsidiaries, parent entities, affiliates, subcontractors (other than Specialized Subcontractors in accordance with ITA 25.2 above) or any other firm(s) different from the Applicant shall not be considered.", "The Procuring Entity reserves the right to accept or reject any Application, and to annul the prequalificationprocess and reject all Applications at any time, without thereby incurring any liability to the Applicants.", "All Applicants whose Applications substantially meet or exceed the specified qualification requirements willbe prequalified by the Procuring Entity. The Procuring", "Entity shall notify all Applicants in writing of the names of those Applicants who have been prequalified or conditionally prequalified. In addition, those Applicants who have been disqualified will be informed separately.", "Applicants that have not been prequalified may write to the Procuring Entity to", "request, in writing, the groundson which they were disqualified.", "Promptly after the notification of the results of the prequalification, the Procuring Entity shall invite Tendersfrom all the Applicants that have been prequalified or conditionally prequalified", "Applicants may be required to provide a Tender Security or a Tender-Securing Declaration acceptable to the Procuring Entity in the form and an amount to be specified in the tendering document.", "The successful Applicant shall be required to provide a Performance Security as", "specified in the tenderingdocument.", "Any change in the structure or formation of an Applicant after being prequalified in accordance with ITA 27 and invited to tender (including, in the case of a JV, any change in the structure or formation of any member and also including any change in any specialized subcontractor whose qualifications were considered to prequalify the Applicant) shall be subject to the written approval of the Procuring Entity prior to the deadline for submission of Tenders. Such approval shall be denied if", "a prequalified applicant proposes to associate with a disqualified applicant or in case of a", "disqualified joint venture, any of its members;", "as a consequence of the change, the Applicant no longer substantially meets the", "qualification criteria set forth in Section III (Qualification Criteria and Requirements); or", "in the opinion of the Procuring Entity, the changemay result in a substantial reduction in competition. Any such change should be submitted to the Procuring Entity not later than fourteen (14) days after the date of the Invitation to Tender.", "The procedures for making a Procurement-related Complaint are as specified in the PDS.", "A request for administrative review shall be made in the form provided.", "SECTION III QUALIFICATION CRITERIA AND REQUIREMENTS", "The Procuring Entity will start by examining all the tenders to ensure they meet in all respects the eligibility criteria and other mandatory requirements in the ITT, and that the tender is complete in all aspects in meeting the requirements provided for in the preliminary evaluation criteria outlined below. Tenders that do not pass the Preliminary Examination will be considered non- responsive and will not be considered further.", "Notes:", "Firms that pass all the above requirements will be registered to the Commission list of registeredsuppliers under the mentioned category for a period of two years", "The list will be used for source for quotations competitively basis as and when needs arises.", "Application Submission Letter", "Date\t[insert day, month, and year]", "ITT No. and title\t[insert ITT number and title]", "To: ........................................... [insert full name of Procuring Entity] We, the undersigned, apply to be", "prequalified for the referenced ITT and declare that:", "No reservations: We have examined and have no reservations to the Prequalification Document, including Addendum(s) No(s), issued in accordance with ITA 8: [insert the number and issuing date of each addendum].", "No conflict of interest: We have no conflict of interest in accordance with ITA 5.7;", "Eligibility: We (and our subcontractors) meet the eligibility requirements as stated ITA 5, we have not been suspended by the Procuring Entity based on execution of a Tender/Proposal-Securing Declaration in accordance with ITA 5.8;", "Suspension and Debarment: We, along with any of our subcontractors, suppliers, consultants, manufacturers, or service providers for any part of the contract, are not subject to, and not controlled by any entity or individual that is subject to, a temporary suspension or a debarment imposed by the PPRA. Further, we are not ineligible under the Kenya laws or official regulations or pursuant to a decision of the United Nations Security Council;", "State-owned enterprise or institution: [select the appropriate option and delete the other] [We are not a state- owned enterprise or institution] / [We are a state-owned enterprise or institution but meet the requirements of ITA5.9];", "f) Subcontractors and Specialized Subcontractors: We, in accordance with ITA 24.2 and 25.2, plan to subcontract the following key activities and/or parts of the works or supply contracts:", "............................................... [Insert any of the key activities identified in Section III-4.2 (a)or(b) or 4.3(a) or (b) which the Procuring Entity has permitted under the Prequalification Document and which theApplicant intends to subcontract along with complete details of the Specialized Subcontractors, their qualification and experience]", "Commissions, gratuities, fees: We declare that the following commissions, gratuities, or fees have been paid or are to be paid with respect to the prequalification process, the corresponding Tendering process or execution of the Contract:", "Name of Recipient\tAddress\tReason\tAmount", "[insert full name foreach occurrence]", "[insert street/ number/city/count ry]", "[indicate reason]\t[specify amount", "currency, value, exchange rate and KENYA SHILLING", "equivalent]", "\t\t\t", "[If no payments are made or promised, add the following statement: “No commissions or gratuities have beenor are to be paid by us to agents or any third party relating to this Application]", "Not bound to accept: We understand that you may cancel the prequalification process at any\ttime\tand thatyouareneitherboundtoacceptanyApplicationthatyoumayreceivenortoinvite the prequalified Applicants to Tender for the contract subject of this Prequalification process, without incurring any liability to the Applicants, in accordance with ITA 26.1.", "True and correct: All information, statements and description contained in the Application are in allrespect true, correct and complete to the best of our knowledge and belief.", "Signed\t[insertsignature(s)ofanauthorizedrepresentative(s)oftheApplicant]", "Name\t[insert full name of person signing the Application]", "In the capacity of\t[insert capacity of person signing the Application]", "Duly authorized to sign the Application for and on behalf of: Applicant's Name\t[insert full name of Applicant or the name of", "the JV]", "Address\t[insert street number/town or city/country address]", "Dated on\t[insert day number] day of [insert month], [insert year]", "[For a joint venture, either all members shall sign or only the authorized representative, in which case thepower of attorney to sign on behalf of all members shall be attached]", "Date\t[insert day, month, year]", "ITT No. and title\t[insert ITT number and title]", "Page\t[insert page number] of [insert total number] pages", "Tender is instructed to complete the particulars required in this Form. Tenderer is further reminded that iis an offence to give false information on this Form.", "Tenderer’s Details", "General and Specific Details", "Sole Proprietor, provide the following details. Name in full\t", "Age\t", "Nationality\t", "Country of Origin\t", "Citizenship \t", "Partnership, provide the following details.", "Registered Company, provide the following details.", "Private or public Company \t", "State the nominal and issued capital of the Company-", "Nominal Kenya Shillings (Equivalent) ……………………….....................................…....", "Issued Kenya Shillings (Equivalent) …………………………….....................................…", "Give details of Directors as follows", "Request For Review", "FORM FOR REVIEW (r.203 (1))", "PUBLIC PROCUREMENT ADMINISTRATIVE REVIEW BOARD", "APPLICATION\tNO…………….OF……….….20……...", "BETWEEN", "…………………………...……………………………….", "Request for review of the decision of the…………… (Name of the Procuring Entity of", "……………dated  the…day  of", "………….20……….in the matter of Tender No………..…of …………..20….. for (Tender description).", "I/We……………………………,the above named Applicant(s), of address: Physical address\tP.", "O. Box", "No…………. Tel. No……..Email\t, hereby request the Public Procurement Administrative Review", "Board to review", "the whole/part of the above mentioned decision on the following grounds , namely: 1.", "2.", "By this memorandum, the Applicant requests the Board for an order/orders that: 1.", "2.", "SIGNED ………………. (Applicant) Dated on…………….day of ……………/…20……", "FOR OFFICIAL USE ONLY Lodged with the Secretary Public Procurement Administrative Review Board on\tday of", "………....20….………", "Board Secretary"], "tables": [[["No.", "Tender No.", "Item Description (Goods, works, and Services)", "Eligibility"], ["1.", "A1", "Supply and Delivery of General Office stationery and common user items", "AGPO\nGroups"], ["2.", "A2", "Supply and Delivery of Computers, servers Laptops, Printers, Scanners, Photocopiers and related computer consumables and accessories", "Open"], ["3.", "A3", "Supply and Delivery of Newspapers and Periodicals", "AGPO\nGroups"], ["4.", "A4", "Supply and delivery of electrical items, fixtures and fittings", "AGPO\nGroups"], ["5.", "A5", "Design, supply and delivery of branded promotional materials: t- shirts, caps, banners, carrier bags, brochures, flyers, flexes etc.", "AGPO\nGroups"], ["6.", "A6", "Supply and delivery of staff uniform protective gear and clothing", "Open"], ["7.", "A7", "Supply and delivery of General Office Furniture and office Equipment", "Open"], ["8.", "A8", "Supply of motor vehicle spare parts, tyres, tubes/airbags, batteries, tyre repairs, wheel alignment and balancing", "Open"], ["9.", "A9", "Supply of fuel and lubricants (Electronic fuel card services)", "Open"], ["10.", "A10", "Supply, delivery, installation of computer software, hardware and Networking Equipment.", "Open"], ["11.", "A11", "Supply, Installation, Commissioning & servicing Access Control and CCTV", "Open"], ["12.", "A12", "Supply and delivery of bottled water (Mineral Water) & Leasing of dispensers", "AGPO\nGroups"], ["13.", "A13", "Supply and delivery of Beverages, Sugar and Fresh milk", "AGPO\nGroups"], ["14.", "A14", "Supply and delivery of communication equipment’s i.e., PABX,\naudio visual systems, video conferencing, telephones etc.", "AGPO\nGroups"], ["15.", "A15", "Supply and maintenance of firefighting equipment and other safety provisions e.g., first aid boxes, safety signages,", "open"]], [["16.", "A16", "Supply and delivery of Airtime", "AGPO"], ["CATEGORY B: REGISTRATION FOR PROVISION OF SERVICES", "CATEGORY B: REGISTRATION FOR PROVISION OF SERVICES", "CATEGORY B: REGISTRATION FOR PROVISION OF SERVICES", "CATEGORY B: REGISTRATION FOR PROVISION OF SERVICES"], ["15.", "B1", "Provision of Travel and air ticket services (IATA/KATA registered firms registered)", "Open"], ["16", "B2", "Provisions for motor vehicle repairs and maintenance services\n(Approved garages to attach certificates or letters of approval)", "Open"], ["17", "B3", "Repairs, Service and Maintenance of Computers, Printers, UPS, PABX, Telephone Extensions, Fax Machines and other related equipment’s.", "Open"], ["18", "B4", "Provision of Comprehensive medical insurance cover, group life cover, WIBA, GPA and general insurance services", "Open"], ["19.", "B5", "Provision of office Partitioning, Repairs, Refurbishment an d\nFurnishings i.e., curtains, carpets and painting. ( Registered by Ministry of Public Works)", "Open"], ["20.", "B6", "Provision of Car Hire and Taxi Services in Nairobi and in Major\ntowns (Preferably Mombasa, Kisumu, Eldoret, Nakuru, Naivasha, Nyeri, Isiolo, Nyahururu and Garissa)", "Open"], ["21.", "B7", "Provision of Courier and Freight Services across all Counties", "Open"], ["22.", "B8", "Provision of Event Organization, Public relations services, public address system, Exhibitions, Road-show and other related services.", "Open"], ["23.", "B9", "Provision of Simultaneous interpretation equipment, Sign language interpretation and Translation Services", "Open"], ["24.", "B10", "Provision of Comprehensive cleaning services, garbage collection and fumigation, and sanitary wares", "AGPO\nGroups"], ["25.", "B11", "Provision and servicing of firefighting, fire protection and safety equipment & training services", "Open"], ["26.", "B12", "Provision of Signage and branding services", "Open"], ["27.", "B13", "Provision of entertainment services (DJs, Bands, Musicians, Models, Hostesses, MCs and Dancers etc.)", "Open"], ["28.", "B14", "Provision of Asset codding tracking services", "AGPO\nGroups"], ["29.", "B15", "Provision of interior design and decoration services", "AGPO\nGroups"], ["30.", "B16", "Repair and Maintenance of Office Furniture & Fittings", "AGPO\nGroups"], ["31.", "B17", "Provision of photography, video coverage and still pictures", "Open"], ["32", "B18", "Provision of creative design, Printing, binding, editorial services, report typesetting etc.", "AGPO\nGroups"], ["33.", "B19", "Provision of specialized services (writing, rapporteuring and illustrations)", "Open"], ["34.", "B20", "Provision of digital marketing services/premium rate mobile services\n(PRSP services)", "Open"], ["35.", "B21", "Provision of Advertising Agency services (Concept Design, artwork execution and Media strategy & buying etc.)", "Open"], ["36.", "B22", "Provision of Training and Team Building Services", "Open"], ["37.", "B23", "Provision of Conference Facilities within Nairobi County and other counties.", "Open"]], [["38.", "B24", "Provision and/or Repair &Maintenance of Air Conditioners", "Open"], ["39.", "B25", "Provision of Internet, Wide Area Networking and cloud\nsolutions.", "Open"], ["40.", "B26", "Provision of Data Communication Services, Computer\nNetworks, Structured Cabling, website development, Hosting and Maintenance services.", "Open"], ["41.", "B27", "Provision of catering services in Nairobi, Mombasa, Eldoret, Kisumu, Nyahururu, Garissa and Isiolo", "Open"], ["42.", "B28", "Provision of professional movers", "Open"], ["43.", "B 29", "Provision of Legal Services", "Open"], ["44.", "B 30", "Provision of Auctioneering Services (Registered by Auctioneering licensing board)", "Open"], ["45.", "B31", "Supply, delivery and installation of Corporate Systems including Electronics Documents and Records Management System (EDRMS)\n; Enterprise Resources Planning System; Dynamic & Interactive E- Learning Platform; helpdesk solution; Onsite and Offsite Data Backup Solution.", "Open"], ["46.", "B 32", "Provision of Asset Valuation Services", "Open"], ["47.", "B33", "Provision of tea vending services and supply of beverages", "Open"], ["48.", "B34", "Provision of car tracking services", "Open"], ["49.", "B35", "Provision of General Insurance cover", "Open"], ["CATEGORY C: REGISTRATION FOR PROVISION OF CONSULTANCY S E R V I C E S", "CATEGORY C: REGISTRATION FOR PROVISION OF CONSULTANCY S E R V I C E S", "CATEGORY C: REGISTRATION FOR PROVISION OF CONSULTANCY S E R V I C E S", "CATEGORY C: REGISTRATION FOR PROVISION OF CONSULTANCY S E R V I C E S"], ["50.", "C1", "Provision of Research consultancy services (e.g., Customer satisfaction, perception survey, media monitoring, Employee\nsatisfaction & work environment survey etc.)", "Open"], ["51.", "C2", "Provision of HR management/consultancy Services (e.g., Training and development, recruitment, team building\nservices, etc.)", "Open"], ["52.", "C3", "Provision of consultancy services for Business Continuity and Disaster Recovery Plan and Implementation", "Open"], ["53.", "C4", "Provision of monitoring and evaluation services", "Open"], ["54.", "C5", "Provision of professional consultancy services in Development of strategic policy documents, regulations and/or manuals", "Open"]], [["Reference to\nITC Clause", "PARTICULARS OF APPENDIX TO INSTRUCTIONS TO TENDERS"], ["A. General", "A. General"], ["ITA 1.1", "The Procuring Entity is: COMMISSION ON ADMINISTRATIVE JUSTICE\nP.O BOX 20414- 00200, NAIROBI\nTEL: +0202270000\nWEBSITE: www.ombudsman.go.ke\n\nThe identification of the Invitation for Registration is: CAJ/RS/01/2024- 2026\n\nThe particular type of Registration is on: General categories"], ["ITA 5.2", "Maximum number of members in the JV shall be: NOT REQUIRED"], ["B. Contents of the Prequalification Document", "B. Contents of the Prequalification Document"], ["ITA 8.1", "For clarification purposes, the Procuring Entity's address is procurement@ombudsman.go.ke"], ["ITA 8.3", "Questions and requests for clarification made in writing or by email shall reach theProcuring Entity not later than Seven (7) days from closing date."], ["ITT 9.2", "Addendum issued shall be published at the website www.ombudsman.go.ke"], ["C. Preparation of Applications", "C. Preparation of Applications"], ["ITA 12.1 (d)", "The Applicant shall submit with its Application, the following additional documents:\n(NOT APPLICABLE]"], ["ITA 15.2(b)", "The source for determining exchange rates is [NOT APPLICABLE]"], ["ITA 16.2", "In addition to the original, the number of copies to be submitted with the Application is:\nONE COPY"], ["D. Submission of Applications", "D. Submission of Applications"], ["ITA 17.1", "The deadline for Application submission is:\n19th June 2024"], ["ITA 18.1", "Late Applications will be returned unopened to the Applicants."], ["ITA 19.1", "The Procuring Entity will not accept late applications."], ["ITA 20.1", "The opening of the Applications shall be at 19th June 202412.00Pm, CAJ 1ST floor\nHaki center"], ["E. Procedures for Evaluation of Applications", "E. Procedures for Evaluation of Applications"], ["ITA 25.1", "At this time the Procuring Entity does not intend to execute certain specific parts of theWorks by sub-contractors selected in advance."]], [["ITA 31.1", "An Applicant wishes to make a Procurement-related Complaint, the Applicant should submit its complaint in writing (by the quickest means available, that is eitherby hand delivery or email), to the address below; Commission Secretary/CEO\nCommission on Administrative Justice\nP.O Box 20414- 00200 NAIROBI\nEmail procurement@ombudsman.go.ke"]], [["No.", "Item Description", "Pass/Fail"], ["1.", "Attach copy of certificate of Incorporation/ Registration", ""], ["2.", "Attach copy of valid tax compliance certificate or KRA Pin for sole\nProprietors", ""], ["3.", "Attach copy of CR12 certificate or business registration certificate\nand copy of Identity Card for sole proprietors", ""], ["4.", "Attach copy of valid AGPO certificate where applicable", ""], ["5.", "Attach a\tduly\tfilled\tand signed Confidential Business Questionnaire.", ""]], [["Applicant's name\n[insert full name]"], ["In case of Joint Venture (JV), name of each member:\n[insert full name of each member in JV]"], ["Applicant's actual or intended country of registration:\n[indicate country of Constitution]"], ["Applicant's actual or intended year of incorporation:\n[indicate year of Constitution]"], ["Applicant's legal address [in country of registration]:\n[insert street/ number/ town or city/ country]"], ["Applicant's authorized representative informationName: [insert full name]\nAddress: [insert street/ number/ town or city/ country]\nTelephone/Fax numbers: [insert telephone/fax numbers, including country and city codes]\nE-mail address: [indicate e-mail address]"], ["Attached are copies of original documents of\nArticles of Incorporation (or equivalent documents of constitution or association), and/ordocuments of registration of the legal entity named above, in accordance with ITA 5.6.\nIn case of JV, letter of intent to form JV or JV agreement, in accordance with ITA 5.3.\nIn case of state-owned enterprise or institution, in accordance with ITA 5.9 documentsestablishing:\nLegal and financial autonomy Operation under commercial law\nEstablishing that the Applicant is not under supervision of the Procuring Entity\n2. Included are the organizational chart, a list of Board of Directors, and the beneficial ownership."]], [["", "ITEM", "DESCRIPTION"], ["1", "Name of the Procuring Entity", ""], ["2", "Reference Number\tof\tthe Tender", ""], ["3", "Name of the Tenderer", ""], ["4", "Date and Time\tof\tTender Opening", ""], ["5", "Full\taddress and\tContact Details of the Tenderer", "Country"], ["5", "Full\taddress and\tContact Details of the Tenderer", "City"], ["5", "Full\taddress and\tContact Details of the Tenderer", "Location"], ["5", "Full\taddress and\tContact Details of the Tenderer", "Building"], ["5", "Full\taddress and\tContact Details of the Tenderer", "Floor"], ["5", "Full\taddress and\tContact Details of the Tenderer", "Postal Address"], ["5", "Full\taddress and\tContact Details of the Tenderer", "Name and Email of Contact Person"], ["6", "Current Trade License Registration Number and Expiring Date", ""], ["7", "Name, Country and Full Address (postal and physical addresses, emailand telephone number) of registering Body/Agency", ""], ["8", "Description\tof\tNature\tof Business", ""], ["9", "Maximum value of Business which the Tenderer handles", ""], ["10", "State if Tenders Company is listed in stock exchange, give full name and full address (postal and physical address, email and telephone number) of\nstate which stock exchange", ""]], [["", "Name of Partners", "Nationality", "Citizenship", "%\tShares Owned"], ["1", "", "", "", ""], ["2", "", "", "", ""], ["3", "", "", "", ""], ["4", "", "", "", ""], ["5", "", "", "", ""], ["6", "", "", "", ""], ["7", "", "", "", ""], ["8", "", "", "", ""]], [["", "Name of Directors", "Nationality", "Citizenship", "%\tShares Owned"], ["1", "", "", "", ""], ["2", "", "", "", ""], ["3", "", "", "", ""], ["4", "", "", "", ""], ["5", "", "", "", ""], ["6", "", "", "", ""], ["7", "", "", "", ""], ["8", "", "", "", ""]]], "headers": ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], "footers": ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], "text_boxes": []}